"""
[Title/Звание]

Defend the summit

[Description/Обрисовка]

Defend the summit - Tower Defense игра, в която играчът има достъп до множество герои, всеки от които има специални способности,
които помагат в спирането на прииждащи легиони от чудовища, заплашващи да унищожат замъкът на надеждата.


[Functionalities/Надарености]

1- Закупуване на герой
При натискане на Buy, на играчът се дава един случаен герой. Ако героят не присъства на полето, то той веднага се поставя на първата свободна позиция на първия възможен ред
Ако обаче присъства, то текущият се upgrade-ва до следващо ниво, даващо му повече сила и бързина, а за някои герои - и специални възможности
2- Колекциониране на монети
Закупуването на герои се осъществява чрез монети, които се добиват при убиване на чудовищата. Тези монети освен за закупуване на герой,
могат да се използват и за закупуване на отвари, които също помагат в боя
3- Активиране на специални сили
Ако играчът има герой на полето, който е достигнал върховия си етап на еволюция, то той може да активира неговата специална сила
4- Убиване на чудовища
Това може да се осъществи по много начини:
С basic attack от страна на някой от героите на играча
С отвара
Със специална сила на някой от героите
Чрез спиране на играта
5- Отварите
Имаме различни видове отвари. Някой от тях директно правят damage на чудовищата, докато други подсилват attack dmg и attack speed на 
всички герои на играча, или пък забавят скоростта на чудовищата, давайки повече време на играча да ги унищожи
6- Героите
Всеки герои има basic attack - Това е атака, която този герой има, независимо от неговото ниво
При нарастване на нивото му, нараства и неговата сила. А някои дори отключват и специални сили
Всеки герой има атрибути като attack damage и attack speed, като някой дори имат и други способности, като например AOE damage, slow, stun
7- Чудовищата
Всяко чудовище е различно само по себе си.
Някои са бързи, но слаби
Други пък бавни, но тежки
А трети пък дори успяват да ударят защитниците на замъка, нанасяйки им damage
Броят на чудовищата нараства със всеки изминал рунд, както и тяхната сила
Тяхната цел е да достигнат до замъка, като за всяко достигнало чудовище, замъкът губи по 1 кръв
8- Замъкът
Замъкът има общо 5 кръв. Тоест, ако 5 чудовища успеят да го достигнат, то замъкът рухва и играта приключва
9- Босове
На всеки 10 рунда се появява boss - той е специално чудовище, което доста трудно за убиване, като различните босове имат и различни сили
някои от тях намаляват нивата на всички герои на играча, други пък ги замразяват за известно време и т.н
10 - Synergy
Важно е какви герои използва играча. Това е така, тъй като има известни комбинации, които водят до различни ефекти.
Например, ако чудовище е атакувано от огнена атака, последвана от водна, то това води до реакция изпарение. Тя прави допълнително damage на чудовището
Друга реакция е например void - след атака от light и dark герои, която кара чудовището да загуби своято ориентация и да върви назад 
Имаме още и реакцията explode - при последователна атака от две fire чудовища, активира експлоция, която прави damage на всички чудовища на съответния ред

[Milestones/Възлови точки]

Графичен интерфейс
main loop, които да обработва командите
ООП архитектура за героите и чудовищата
Проверки за състоянията на чудовищата и героите
Тестове

[Estimate in man-hours/Времеоценка в човекочасове]

учене на pygame - min: 4 hours , max: infinity
съставяне на изображения за фон - 30 минути
съставяне на визуални модели на героите и техните способности - поне 2 часа
съставяне на модели на чудовища - 2 часа
ООП дизайна на героите и чудовищата - 5 часа
измисляне и осъществяване на основната логика на играта, както и възможните колизии между обектите - min: 6 hours, max: infinity
сменяне на темата на проекта 2167124 пъти, защото осъзнавам, че някои неща са или много трудни, или прекалено елементарни и няма особен смисъл от тях - 10 часа 

[Usage of technologies/Потребление на технологии]
pygame
модули като sys, random
"""